Tekla Open API Reference for Tekla Structures 2025
ProfileItem.GetProfileItemSubTypes Method
Overload List
Name | Description
GetProfileItemSubTypes()
 Selects the profile item and updates the sub types in the profile database.
GetProfileItemSubTypes(ProfileItem, ProfileItem.ProfileItemTypeEnum)
Top
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace